podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIOA_S32K14x.svd.xml
<!--
Devices using this peripheral: 
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "GPIOA_S32K14x" ?>
         <name>GPIOA</name>
         <description>General Purpose Input/Output</description>
         <groupName>GPIO</groupName>
         <headerStructName>PT</headerStructName>
         <baseAddress>0x400FF000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PDOR</name>
               <description>Port Data Output Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>PDO</name>
                     <description>Port Data Output</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSOR</name>
               <description>Port Set Output Register</description>
               <addressOffset>0x4</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PTSO</name>
                     <description>Port Set Output</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCOR</name>
               <description>Port Clear Output Register</description>
               <addressOffset>0x8</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PTCO</name>
                     <description>Port Clear Output</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTOR</name>
               <description>Port Toggle Output Register</description>
               <addressOffset>0xC</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PTTO</name>
                     <description>Port Toggle Output</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDIR</name>
               <description>Port Data Input Register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PDI</name>
                     <description>Port Data Input</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDDR</name>
               <description>Port Data Direction Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>PDD</name>
                     <description>Port Data Direction</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR</name>
               <description>Port Input Disable Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>PID</name>
                     <description>Port Input Disable</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
